Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: You can find an alphabetical list here: |functions|.
es_es: En |functions| se encuentra una lista de ellas ordenada alfabéticamente.

source: Use CTRL-] on the function name to jump to detailed help on it.
es_es: Puede ubicar el cursor sobre el nombre de una función y pulsar CTRL-] para ver documentación más detallada sobre ella.

source: Cursor and mark position: *cursor-functions* *mark-functions* col() column number of the cursor or a mark virtcol() screen column of the cursor or a mark line() line number of the cursor or mark wincol() window column number of the cursor winline() window line number of the cursor cursor() position the cursor at a line/column getpos() get position of cursor, mark, etc.
es_es: Posición de marcas y del cursor: *cursor-functions* *mark-functions* col() número de columna del cursor o de una marca virtcol() número de columna en pantalla del cursor o de una marca line() número de línea del cursor o de una marca wincol() número de columna de ventana del cursor winline() número de línea de ventana del cursor cursor() ubica el cursor en una linea/columna getpos() obtiene la posición del cursor, marca, etc.

source: setpos() set position of cursor, mark, etc.
es_es: setpos() define la posición del cursor, marca, etc.

source: byte2line() get line number at a specific byte count line2byte() byte count at a specific line diff_filler() get the number of filler lines above a line
es_es: byte2line() obtiene el número de línea correspondiente a un índice en bytes line2byte() índice en bytes correspondiente a una línea específica diff_filler() obtiene la cantidad de líneas de relleno encima de una línea

source: Vim enables you to define your own functions.
es_es: Vim permite definir nuevas funciones.

source: The basic function declaration begins as follows: >
es_es: La definición básica de una función corresponde a lo siguiente: >

source: Let's define a short function to return the smaller of two numbers.
es_es: Vamos a definir una función pequeña que retorne el más pequeño de dos números.

source: It starts with this line: >
es_es: Su definición empieza con esta línea: >

source: This tells Vim that the function is named "Min" and it takes two arguments: "num1" and "num2".
es_es: Ésta le indica a Vim que la función se llama «Min» y que recibe dos argumentos: «num1» y «num2».

source: The first thing you need to do is to check to see which number is smaller: > : if a:num1 < a:num2
es_es: El primer paso es comprobar qué número es el más pequeño: > : if a:num1 < a:num2

source: The special prefix "a:" tells Vim that the variable is a function argument.
es_es: El prefijo especial «a:» le indica a Vim que la variable es un argumento de la función.

source: Let's assign the variable "smaller" the value of the smallest number: >
es_es: Asignemos ahora a la variable «menor» el valor del menor número: >

source: The variable "smaller" is a local variable.
es_es: La variable «menor» es una variable local.

source: Variables used inside a function are local unless prefixed by something like "g:", "a:", or "s:".
es_es: Las variables usadas dentro de una función son locales a menos que tengan un prefijo como «g:», «a:», o «s:».

source: Note: To access a global variable from inside a function you must prepend "g:" to it.
es_es: Nota: Para usar una variable global dentro de una función debe anteponer «g:» a su nombre.

source: Thus "g:today" inside a function is used for the global variable "today", and "today" is another variable, local to the function.
es_es: Dentro de una función, «g:hoy» corresponde a la variable global «hoy», y «hoy» es otra variable, local respecto a la función.

source: You now use the ":return" statement to return the smallest number to the user.
es_es: Ahora usamos la instrucción «:return» para devolver el menor de los dos números al usuario.

source: Finally, you end the function: >
es_es: Finalmente, terminamos la función: >

source: A user defined function is called in exactly the same way as a built-in function.
es_es: Las funciones definidas por el usuario se invocan exactamente de la misma forma que las funciones internas.

source: Only the name is different.
es_es: La única diferencia es el nombre.

source: The Min function can be used like this: >
es_es: Puede usar la función Min como sigue: >

source: Only now will the function be executed and the lines be interpreted by Vim.
es_es: Sólo en este momento se ejecutará la función y Vim interpretará las instrucciones que la componen.

source: If there are mistakes, like using an undefined variable or function, you will now get an error message.
es_es: Si hay errores, como usar una variable o función no definida, se mostrará un mensaje de error.

source: When defining the function these errors are not detected.
es_es: Al definir una función estos errores no son detectados.

source: The ":call" command can be given a line range.
es_es: La orden «:call» puede recibir un rango de líneas.

source: This can have one of two meanings.
es_es: Este rango puede tener dos significados.

source: When a function has been defined with the "range" keyword, it will take care of the line range itself.
es_es: Cuando la definición de una función tiene la palabra clave «range», ésta se hará cargo del rango de líneas.

source: The function will be passed the variables "a:firstline" and "a:lastline".
es_es: La función recibirá las variables «a:firstline» y «a:lastline».

source: These will have the line numbers from the range the function was called with.
es_es: Éstas contendrán los números de línea del rango con el cual se invoca la función.

source: :function Count_words() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "found " . n .
es_es: :function Contar_palabras() range : let lnum = a:firstline : let n = 0 : while lnum <= a:lastline : let n = n + len(split(getline(lnum))) : let lnum = lnum + 1 : endwhile : echo "encontradas " . n .

source: " words" :endfunction
es_es: " palabras" :endfunction

source: It will be executed once and echo the number of words.
es_es: La función se ejecutará una vez, y mostrará en la pantalla el número de palabras.

source: The other way to use a line range is by defining a function without the "range" keyword.
es_es: La otra forma de usar un rango de líneas es definiendo una función sin la palabra clave «range».

source: The function will be called once for every line in the range, with the cursor in that line.
es_es: Se invocará la función una vez por cada línea en el rango, y el cursor estará en la línea correspondiente a cada invocación.

source: :function Number() : echo "line " . line(".") .
es_es: :function Numero() : echo "la línea " . line(".") .

source: " contains: " . getline(".") :endfunction
es_es: " contiene: " . getline(".") :endfunction

source: Vim enables you to define functions that have a variable number of arguments.
es_es: Vim permite la definición de funciones que reciben una cantidad variable de argumentos.

source: The following command, for instance, defines a function that must have 1 argument (start) and can have up to 20 additional arguments: >
es_es: Por ejemplo, la siguiente orden define una función que debe recibir un argumento (inicio) y puede recibir hasta 20 argumentos adicionales: >

source: The variable "a:1" contains the first optional argument, "a:2" the second, and so on.
es_es: La variable «a:1» contiene el primer argumento opcional, «a:2» contiene el segundo, y así sucesivamente.

source: The variable "a:0" contains the number of extra arguments.
es_es: La variable «a:0» contiene la cantidad de argumentos adicionales.

source: :function Show(start, ...) : echohl Title : echo "Show is " . a:start : echohl None : let index = 1 : while index <= a:0 : echo " Arg " . index .
es_es: :function Mostrar(inicio, ...) : echohl Title : echo "inicio es " . a:inicio : echohl None : let indice = 1 : while indice <= a:0 : echo " Arg " . indice .

source: " is " . a:{index} : let index = index + 1 : endwhile : echo "" :endfunction
es_es: " is " . a:{indice} : let indice = indice + 1 : endwhile : echo "" :endfunction

source: This uses the ":echohl" command to specify the highlighting used for the following ":echo" command.
es_es: Aquí se usa la orden «:echohl», que especifica el resaltado a usar en la siguiente orden «:echo».

source: ":echohl None" stops it again.
es_es: «:echohl None» hace que no se use resaltado alguno.

source: The ":echon" command works like ":echo", but doesn't output a line break.
es_es: La orden «:echon» es similar a «:echo» pero no imprime el cambio de línea final.

source: The line number is useful for when you get an error message or when debugging.
es_es: El número de línea de una instrucción es información útil cuando aparece un mensaje de error o al depurar scripts.

source: See |debug-scripts| about debugging mode.
es_es: Acerca del modo de depurado, consulte |debug-scripts|.

source: You can also set the 'verbose' option to 12 or higher to see all function calls.
es_es: Puede darle un valor de 12 o más a la opción 'verbose' para ver todas las invocaciones a funciones.

source: Set it to 15 or higher to see every executed line.
es_es: Con un valor de 15 o más verá cada línea ejecutada.

source: Sometimes it can be useful to have a variable point to one function or another.
es_es: En ocasiones es útil que una variable pueda hacer referencia a una u otra función .

source: You can do it with the function() function.
es_es: Puede hacerlo usando la función function().

source: It turns the name of a function into a reference: >
es_es: Ésta función convierte el nombre de una función en una referencia a la misma: >

source: :let result = 0 " or 1 :function!
es_es: :let resultado = 0 " o 1 :function!

source: Right() : return 'Right!' :endfunc :function!
es_es: Bien() : return '¡Bien!' :endfunc :function!

source: Wrong() : return 'Wrong!' :endfunc : :if result == 1 : let Afunc = function('Right') :else : let Afunc = function('Wrong') :endif :echo call(Afunc, []) < Wrong!
es_es: Mal() : return '¡Mal!' :endfunc : :if resultado == 1 : let Unafunc = function('Bien') :else : let Unafunc = function('Mal') :endif :echo call(Unafunc, []) < ¡Mal!

source: Note that the name of a variable that holds a function reference must start with a capital.
es_es: Tenga en cuenta que el nombre de la variable que contiene la referencia a la función debe empezar con una letra mayúscula.

source: Otherwise it could be confused with the name of a builtin function.
es_es: En caso contrario, es posible que se confunda con el nombre de una de las funciones integradas de Vim.

source: The way to invoke a function that a variable refers to is with the call() function.
es_es: Para invocar una función usando una variable con una referencia a función se usa la función call().

source: Its first argument is the function reference, the second argument is a List with arguments.
es_es: Como primer argumento recibe la referencia a la función, y como segundo argumento una Lista con los argumentos para la función a invocar.

source: So far we have used the basic types String and Number.
es_es: Hasta ahora hemos usado los tipos básicos, Cadena de texto y Número.

source: Vim also supports two composite types: List and Dictionary.
es_es: Vim también ofrece otros dos: Lista y Diccionario.

source: A List is an ordered sequence of things.
es_es: Una Lista es una secuencia ordenada de elementos.

source: The things can be any kind of value, thus you can make a List of numbers, a List of Lists and even a List of mixed items.
es_es: Los elementos pueden ser de cualquier tipo, así que puede crear una Lista de números, una Lista de Listas e incluso una Lista de elementos de tipos diferentes.

source: To create a List with three strings: >
es_es: Para crear una Lista con tres cadenas de texto: >

source: The List items are enclosed in square brackets and separated by commas.
es_es: Los elementos de la Lista se rodean con corchetes y se separan con comas.

source: To create an empty List: >
es_es: Para crear una Lista vacía: >

source: This will loop over each element in List "alist", assigning the value to variable "n".
es_es: El código mostrado iterará sobre cada elemento en la Lista «lista», asignando el valor del elemento a la variable «n».

source: The generic form of a for loop is: >
es_es: La forma genérica de un ciclo «for» es: >

source: To loop a certain number of times you need a List of a specific length.
es_es: Para iterar una cantidad determinada de veces necesita una Lista con una longitud específica.

source: The range() function creates one for you: >
es_es: La función range() puede crearla por usted: >

source: Notice that the first item of the List that range() produces is zero, thus the last item is one less than the length of the list.
es_es: Observe que el primer elemento de la Lista creada por range() es cero, y por tanto el último elemento tiene un valor de uno menos que la longitud de la lista.

source: You can also specify the maximum value, the stride and even go backwards: >
es_es: También puede especificar el valor máximo, y el incremento o decremento deseado: >

source: A Dictionary stores key-value pairs.
es_es: Un Diccionario almacena pares clave-valor.

source: You can quickly lookup a value if you know the key.
es_es: Esto le permite obtener un valor almacenado de manera rápida, si conoce la clave del mismo.

source: A Dictionary is created with curly braces: >
es_es: Los Diccionarios se crean usando llaves: >

source: The possibilities with Dictionaries are numerous.
es_es: Los Diccionarios ofrecen numerosas posibilidades.

source: There are various functions for them as well.
es_es: También dispone de varias funciones para operar sobre ellos.

source: For example, you can obtain a list of the keys and loop over them: >
es_es: Por ejemplo, puede obtener una lista de las claves e iterar sobre ellas: >

source: You will notice the keys are not ordered.
es_es: Habrá notado que las claves no están ordenadas.

source: You can sort the list to get a specific order: >
es_es: Puede ordenar la lista para obtener un orden específico: >

source: But you can never get back the order in which items are defined.
es_es: No es posible recuperar el orden en el cual se definieron los elementos del Diccionario.

source: For that you need to use a List, it stores items in an ordered sequence.
es_es: Para eso necesita una Lista, que almacena los elementos en una secuencia ordenada.

source: This only works for a key that is made of ASCII letters, digits and the underscore.
es_es: Esto sólo funciona con claves compuestas de caracteres ASCII, dígitos, y el guión bajo.

source: You can also assign a new value this way: >
es_es: También puede usar esta notación para asignar valores: >

source: The first special thing you notice is the "dict" at the end of the ":function" line.
es_es: Lo que habrá notado primero es el «dict» al final de la línea «:function».

source: This marks the function as being used from a Dictionary.
es_es: Así se indica que la función será usada desde un Diccionario.

source: The "self" local variable will then refer to that Dictionary.
es_es: La variable local «self» se referirá a dicho diccionario.

source: Now let's break up the complicated return command: >
es_es: Ahora, dividamos esa compleja instrucción de retorno: >

source: The split() function takes a string, chops it into white separated words and returns a list with these words.
es_es: La función split() toma una cadena, la divide en palabras separadas por espacios en blanco, y entrega una lista con estas palabras.

source: Thus in the example it returns: >
es_es: En el ejemplo previo, entrega: >

source: This list is the first argument to the map() function.
es_es: Esta lista es el primer argumento para la función map().

source: This will go through the list, evaluating its second argument with "v:val" set to the value of each item.
es_es: Dicha función analizará la lista, evaluando su segundo argumento con la variable «v:val» definida con el valor de cada elemento en la lista.

source: This is a shortcut to using a for loop.
es_es: Es una abreviación de un ciclo for.

source: This command: >
es_es: Esta instrucción: >

source: The get() function checks if a key is present in a Dictionary.
es_es: La función get() comprueba si una clave existe en un Diccionario.

source: If it is, then the value is retrieved.
es_es: Si existe, devuelve el valor asociado a la clave.

source: If it isn't, then the default value is returned, in the example it's '???'.
es_es: Si no existe, devuelve el valor definido como predeterminado, que en el ejemplo es '???'.

source: This is a convenient way to handle situations where a key may not be present and you don't want an error message.
es_es: Esto permite manejar de una forma conveniente las situaciones en que una clave no existe y no desea hacer el manejo del error que provocaría dicha situación.

source: The join() function does the opposite of split(): it joins together a list of words, putting a space in between.
es_es: La función join() es el complemento de split(): une una lista de palabras, separándolas con un espacio.

source: This combination of split(), map() and join() is a nice way to filter a line of words in a very compact way.
es_es: La combinación de split(), map(), y join() es una forma elegante de filtrar una cadena de palabras de manera sucinta.

source: Now that you can put both values and functions in a Dictionary, you can actually use a Dictionary like an object.
es_es: Ahora que podemos guardar valores y funciones en un Diccionario, podemos usar un Diccionario como un objeto.

source: Above we used a Dictionary for translating Dutch to English.
es_es: Anteriormente hicimos uso de un Diccionario para traducir texto de Holandés a Español.

source: We might want to do the same for other languages.
es_es: Querríamos hacer lo mismo para otros idiomas.

source: Let's first make an object (aka Dictionary) that has the translate function, but no words to translate: >
es_es: Primero crearemos un objeto (esto es, un Diccionario) que tenga la función traducir, pero no tenga palabras para traducir: >

source: It's slightly different from the function above, using 'self.words' to lookup word translations.
es_es: La definición es ligeramente diferente de la función anterior, ya que usa 'self.words' para buscar las traducciones de palabras.

source: But we don't have a self.words.
es_es: Pero no hay un self.words.

source: Thus you could call this an abstract class.
es_es: Por esto decir que el Diccionario es una clase abstracta.

source: You see that the copy() function is used to make a copy of the "transdict" Dictionary and then the copy is changed to add the words.
es_es: Puede ver que la función copy() se usa para crear una copia del Diccionario «dicctraductor» y luego se cambia la copia, añadiendo las palabras.

source: The original remains the same, of course.
es_es: El original, por supuesto, permanece intacto.

source: Here "trans" refers to one of the two objects (Dictionaries).
es_es: Aquí «trad» se refiere a uno de dos posibles objetos (Diccionarios).

source: No copy is made.
es_es: No se hace ninguna copia.

source: More about List and Dictionary identity can be found at |list-identity| and |dict-identity|.
es_es: Puede encontrar más información acerca de la identidad de Listas y Diccionarios en |list-identity| y |dict-identity|.

source: Now you might use a language that isn't supported.
es_es: Puede que use un idioma que aún no esté incluido.

source: You can overrule the translate() function to do nothing: >
es_es: Para este caso, puede redefinir la función traducir() para que no haga nada: >

source: Notice that a ! was used to overwrite the existing function reference.
es_es: Note el «!» utilizado para redefinir la referencia a función existente.

source: Now use "uk2uk" when no recognized language is found: >
es_es: Ahora puede usar «es2es» cuando no se encuentra ningún idioma reconocido: >

source: The ":read" command will fail if the file does not exist.
es_es: La orden «:read» (leer) fallará si el archivo no existe.

source: Instead of generating an error message, this code catches the error and gives the user a nice message instead.
es_es: En vez de mostrar un mensaje de error, este código atrapa el error y le muestra al usuario un mensaje más agradable.

source: For the commands in between ":try" and ":endtry" errors are turned into exceptions.
es_es: Para las instrucciones entre «:try» y «:endtry» los errores se convierten en excepciones.

source: An exception is a string.
es_es: Una excepción es una cadena de texto.

source: In the case of an error the string contains the error message.
es_es: Cuando aparece un error esta cadena contiene el mensaje de error.

source: And every error message has a number.
es_es: Y cada mensaje de error tiene un número.

source: In this case, the error we catch contains "E484:".
es_es: En este caso, el error que atrapamos contiene «E484:».

source: This number is guaranteed to stay the same (the text may change, e.g., it may be translated).
es_es: Vim garantiza que este número permanece inalterado (el texto del mensaje de error puede cambiar, por ejemplo, puede haber sido traducido.)

source: When the ":read" command causes another error, the pattern "E484:" will not match in it.
es_es: Cuando la orden «:read» genera un error distinto, el patrón «E484:» no coincidirá con él.

source: Thus this exception will not be caught and result in the usual error message.
es_es: La excepción no será atrapada y aparecerá el mensaje de error habitual en esos casos.

source: This means all errors are caught.
es_es: De esta forma se atrapan todos los errores.

source: But then you will not see errors that are useful, such as "E21: Cannot make changes, 'modifiable' is off".
es_es: Pero al hacerlo no verá errores que son útiles, como por ejemplo «E21: No se pudo modificar, 'modifiable' está desactivado»

source: This filters the lines from the cursor until the end of the file through the "filter" command, which takes a file name argument.
es_es: Aquí se filtran las líneas desde el cursor hasta el final del archivo usando la orden «filter», que toma como argumento un nombre de archivo.

source: No matter if the filtering works, something goes wrong in between ":try" and ":finally" or the user cancels the filtering by pressing CTRL-C, the "call delete(tmp)" is always executed.
es_es: No importa si el filtrado funciona, si algo sale mal entre «:try» y «:finally», o si el usuario cancela el filtrado presionando CTRL-C, la instrucción «call delete(tmp)» siempre se ejecuta.

source: This makes sure you don't leave the temporary file behind.
es_es: Así se asegura de que no queden archivos temporales al acabar el proceso.

source: Here is a summary of items that apply to Vim scripts.
es_es: A continuación tiene un resumen de los elementos relevantes para escribir scripts de Vim.

source: They are also mentioned elsewhere, but form a nice checklist.
es_es: También se los menciona en otros lugares de la documentación, pero aquí se presentan como una conveniente lista.

source: The end-of-line character depends on the system.
es_es: El carácter de fin de línea usado depende del sistema.

source: For Unix a single <NL> character is used.
es_es: En sistemas Unix se usa <NL>.

source: For MS-DOS, Windows, OS/2 and the like, <CR><LF> is used.
es_es: En MS-DOS, Windows, OS/2 y similares, se usa <CR><LF>.

source: This is important when using mappings that end in a <CR>.
es_es: Éste es un detalle importante a considerar al usar macros que terminan en <CR>.

source: See |:source_crnl|.
es_es: Consulte |:source_crnl|.
